---
kind: property
id: P:Autodesk.Revit.DB.Category.SubCategories
source: html/e2f50049-832c-9b72-70b1-2a0a96e16a60.htm
---
# Autodesk.Revit.DB.Category.SubCategories Property

Returns a map containing all of the subcategories of this category.

## Syntax (C#)
```csharp
public CategoryNameMap SubCategories { get; }
```

## Returns
An empty map if the category has no subcategories.